#+title: Installing faasd
#+subtitle: cgi was good, serverless is better
#+tags: faasd, serverless, cloud, openfaas
#+date: 2021-02-08

Recently I came across [[https://releasecandidate.dev/posts/2021/discovery-faasd-and-openfaas/][an article]] on faasd, and I thought I'd give it
a try and see how easy it is to use.  [[https://willschenk.com/articles/2020/server_templating_with_terraform/][Server templating]] is an easy way
to create a server with DNS, and following the whole [[https://willschenk.com/articles/2020/leveraging_disposability_for_exploration/][disposability]]
principals, we'll whip something up and see how it goes.

* Install =faas-cli=

My server is =faas.willschenk.com= so lets first install the cli tool,
and then point it to it.

#+begin_src bash
  curl -sSL https://cli.openfaas.com | sudo sh
  export OPENFAAS_URL=https://faas.willschenk.com
  ssh root@faas.willschenk.com cat /var/lib/faasd/secrets/basic-auth-password | faas-cli login --username admin --password-stdin
#+end_src

We can then deploy our first function by

#+begin_src bash
  faas-cli store deploy nodeinfo
#+end_src

And run it with:

#+begin_src bash :results output
  curl https://faas.willschenk.com/function/nodeinfo
#+end_src

#+RESULTS:
: Hostname: localhost
: 
: Arch: x64
: CPUs: 2
: Total mem: 1998MB
: Platform: linux
: Uptime: 269013

Nice and easy.  A list of functions available from the store can be found with

#+begin_src bash
  faas-cli store list
#+end_src

* Writing a node12 function

We'll ceate a new one (I'm taking this code from the [[ https://gumroad.com/l/serverless-for-everyone-else][serverless for
everyone else]] book) and we are doing to push it to docker hub.  I'm
already logged in as =wschenk= so that's what I'm setting the
=OPENFAAS_PREFIX= to.

#+begin_src bash
  export OPENFAAS_PREFIX=wschenk

  faas-cli new --lang node12 starbot
#+end_src

Lets install the =axios= package.

#+begin_src bash
  cd starbot
  npm install --save axios
#+end_src

Then lets change the =starbot/handler.js= to

#+begin_src javascript
const axios = require("axios")

module.exports = async (event, context) => {
    let res = await axios.get("http://api.open-notify.org/astros.json")
    let body = `There are currently ${res.data.number} astronauts in space.`
    return context
        .status(200)
        .headers({"Content-type": "application/json"})
        .succeed(body)
}
#+end_src

Then we deploy the function

#+begin_src bash
  faas-cli up -f starbot.yml 
#+end_src

And we can run it with:

#+begin_src bash :results output
curl https://faas.willschenk.com/function/starbot
#+end_src

#+RESULTS:
: There are currently 7 astronauts in space.

Nice!
* Command as a cloud function

Lets look at how to package up a command as a function.

#+begin_src bash
faas-cli new --lang dockerfile fortune
#+end_src

Then we edit the =fortune/Dockerfile=.  Add we are adding here is =RUN
apk add fortune= and setting the =fprocess= to =fortune=.

#+begin_src Dockerfile
FROM ghcr.io/openfaas/classic-watchdog:0.1.4 as watchdog

FROM alpine:3.12

RUN mkdir -p /home/app
RUN apk add fortune

COPY --from=watchdog /fwatchdog /usr/bin/fwatchdog
RUN chmod +x /usr/bin/fwatchdog

# Add non root user
RUN addgroup -S app && adduser app -S -G app
RUN chown app /home/app

WORKDIR /home/app

USER app

# Populate example here - i.e. "cat", "sha512sum" or "node index.js"
ENV fprocess="fortune"
# Set to true to see request in function logs
ENV write_debug="false"

EXPOSE 8080

HEALTHCHECK --interval=3s CMD [ -e /tmp/.lock ] || exit 1

CMD ["fwatchdog"]
#+end_src

Then you can build and deploy with

#+begin_src bash
faas-cli up -f fortune.yml 
#+end_src

Which now is available as:

#+begin_src bash :results output
curl https://faas.willschenk.com/function/fortune
#+end_src

#+RESULTS:
: When I get real bored, I like to drive downtown and get a great
: parking spot, then sit in my car and count how many people ask me if
: I'm leaving.
: 		-- Steven Wright

The whole process took me under a minute for the first time that I did
it, so that's super cool.

